Процедура ЗаполнитьОтсутствующимиПартнерамиИзФайлов () Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
		|	sprt_ПартнерыИзОтчетов.Ссылка КАК ПартнерИзОтчета
		|ИЗ
		|	Справочник.sprt_ПартнерыИзОтчетов КАК sprt_ПартнерыИзОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.sprt_СопоставлениеКлиентов КАК sprt_СопоставлениеКлиентов
		|		ПО sprt_СопоставлениеКлиентов.ПартнерИзОтчета = sprt_ПартнерыИзОтчетов.Ссылка
		|ГДЕ
		|	sprt_СопоставлениеКлиентов.ПартнерИзБазы ЕСТЬ NULL");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.sprt_СопоставлениеКлиентов.СоздатьМенеджерЗаписи();
		Запись.КлючЗаписи = Новый УникальныйИдентификатор();
		Запись.Активно = Истина;
		Запись.ПартнерИзОтчета = Выборка.ПартнерИзОтчета;
		Запись.Записать();
		
	КонецЦикла;
	

КонецПроцедуры
